ams/src/Reports/AMS_ДоговорыСПоставщиками/AMS_ДоговорыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>AMS_ДоговорыСПоставщиками</name>
</mdclass:Report>

ams/src/InformationRegisters/_ПриложенияКДоговорам/_ПриложенияКДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>_ПриложенияКДоговорам</name>
  <resources>
    <name>ДатаПолученияСкана</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПолученияОригинала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПриложения</name>
    <type>
      <types>EnumRef._ВидыПриложенийКДоговорам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Reports/AMS_ДоговорыСПоставщиками/Forms/ФормаПриложений/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Договор = Параметры.Договор;
	Заголовок = "Приложения к " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"НаименованиеДляПечати");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	т.Номер КАК Номер,
		|	т.Дата КАК Дата,
		|	т.ВидПриложения КАК ВидПриложения,
		|	т.Договор КАК Договор,
		|	т.Описание
		|ИЗ
		|	РегистрСведений._ПриложенияКДоговорам КАК т
		|ГДЕ
		|	т.Договор = &Договор
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Табл.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
	ЗаписатьПриложения();
	Закрыть(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьПриложения()
	Набор = РегистрыСведений._ПриложенияКДоговорам.СоздатьНаборЗаписей();
	Набор.Отбор.Договор.Установить(Договор);
	
	Для каждого Стр Из Табл Цикл
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись,Стр);
		Запись.Договор = Договор;
	КонецЦикла;
	
	Набор.Записать();
КонецПроцедуры

#КонецОбласти
